Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
/*
 * This file is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This file is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "AP_HAL_ESP32/Scheduler.h"
#include "AP_HAL_ESP32/RCInput.h"
#include "AP_HAL_ESP32/AnalogIn.h"
#include "ESP32_Debug.h"
#include "ESP32_Params.h"
#include "AP_Math/AP_Math.h"
#include "SdCard.h"
#include "Profile.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp_task_wdt.h"
#include "esp_log.h"
#include "esp_system.h"

#include <AP_HAL/AP_HAL.h>
#include <AP_Scheduler/AP_Scheduler.h>
#include <GCS_MAVLink/GCS.h>
#include <stdio.h>
#include <inttypes.h>

//#define SCHEDULERDEBUG 1

using namespace ESP32;

extern const AP_HAL::HAL& hal;

// RTC memory structure for WDT info (survives resets)
#define WDT_INFO_MAGIC 0xDEADBEEF
RTC_DATA_ATTR struct {
    uint32_t magic;
    char task_name[16];
    uint32_t stack_hwm;
    uint32_t timestamp;
    uint32_t heap_free;
    uint32_t heap_min;
    uint32_t last_pc;  // Last program counter if available
} wdt_info;

bool Scheduler::_initialized = true;

Scheduler::Scheduler()
{
    _initialized = false;
}

Scheduler::~Scheduler()
{
    if (_initialized) {
        esp_task_wdt_deinit();
    }
}

// Note: wdt_info structure is defined above at line 44-54
// with additional fields for heap and PC tracking

#define WDT_INFO_MAGIC 0xDEADBEEF

void Scheduler::wdt_init(uint32_t timeout, uint32_t core_mask)
{
    // Try to reconfigure existing WDT first
    esp_task_wdt_config_t config = {
        .timeout_ms = timeout,
        .idle_core_mask = core_mask,
        .trigger_panic = true
    };

    // First try to deinit if already initialized
    esp_task_wdt_deinit();

    // Now initialize with our config
    esp_err_t wdt_result = esp_task_wdt_init(&config);
    if (wdt_result != ESP_OK) {
        // Only print real errors, not expected ones
        if (wdt_result != ESP_ERR_INVALID_STATE) {
            printf("esp_task_wdt_init() failed with error %d\n", wdt_result);
        }
    }

    if (ESP_OK != esp_task_wdt_add(NULL)) {
        printf("esp_task_wdt_add(NULL) failed");
    }
    
    // Note: ESP-IDF v5.x removed the user callback API
    // WDT info will be captured via panic handler or coredump instead
}

void Scheduler::report_reset_reason()
{
    // Try immediate report (may fail if GCS not ready)
    GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: Check magic=0x%lX exp=0x%lX", 
                  (unsigned long)wdt_info.magic, (unsigned long)WDT_INFO_MAGIC);
    
    // Check for saved WDT info from previous crash
    if (wdt_info.magic == WDT_INFO_MAGIC) {
        GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: Found valid saved info!");
        // Report detailed WDT info
        GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, 
                     "WDT: Task=%s Stack=%lu Heap=%lu/%lu",
                     wdt_info.task_name,
                     (unsigned long)wdt_info.stack_hwm,
                     (unsigned long)wdt_info.heap_free,
                     (unsigned long)wdt_info.heap_min);
        
        // Report last PC if available
        if (wdt_info.last_pc != 0) {
            GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL,
                         "WDT: PC=0x%lX Tick=%lu",
                         (unsigned long)wdt_info.last_pc,
                         (unsigned long)wdt_info.timestamp);
        }
        
        // Clear the magic so we don't report it again
        wdt_info.magic = 0;
    }
    
    esp_reset_reason_t reason = esp_reset_reason();
    const char* reason_str = nullptr;
    MAV_SEVERITY severity = MAV_SEVERITY_INFO;
    
    switch(reason) {
        case ESP_RST_UNKNOWN:
            reason_str = "ESP32 Reset: Unknown reason";
            severity = MAV_SEVERITY_WARNING;
            break;
        case ESP_RST_POWERON:
            reason_str = "ESP32 Reset: Power-on reset";
            break;
        case ESP_RST_EXT:
            reason_str = "ESP32 Reset: External reset (EN pin)";
            break;
        case ESP_RST_SW:
            reason_str = "ESP32 Reset: Software reset (esp_restart)";
            break;
        case ESP_RST_PANIC:
            reason_str = "ESP32 PANIC: Stack overflow or exception";
            severity = MAV_SEVERITY_CRITICAL;
            // Note: Backtrace will be in console output
            // Use decode_esp32_backtrace.sh to analyze
            break;
        case ESP_RST_INT_WDT:
            reason_str = "ESP32 Reset: Interrupt watchdog";
            severity = MAV_SEVERITY_CRITICAL;
            break;
        case ESP_RST_TASK_WDT:
            reason_str = "ESP32 Reset: Task watchdog timeout";
            severity = MAV_SEVERITY_CRITICAL;
            break;
        case ESP_RST_WDT:
            reason_str = "ESP32 Reset: Other watchdog reset";
            severity = MAV_SEVERITY_CRITICAL;
            break;
        case ESP_RST_DEEPSLEEP:
            reason_str = "ESP32 Reset: Wake from deep sleep";
            break;
        case ESP_RST_BROWNOUT:
            reason_str = "ESP32 Reset: Brownout (low voltage)";
            severity = MAV_SEVERITY_CRITICAL;
            break;
        case ESP_RST_SDIO:
            reason_str = "ESP32 Reset: SDIO reset";
            break;
        default:
            reason_str = "ESP32 Reset: Unrecognized code";
            severity = MAV_SEVERITY_WARNING;
            break;
    }
    
    // Send reset reason via MAVLink STATUSTEXT
    if (reason_str != nullptr) {
        GCS_SEND_TEXT(severity, "%s (%d)", reason_str, (int)reason);
    }
    
