Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
    // Additional info for watchdog resets - get more details if available
    if (reason == ESP_RST_TASK_WDT || reason == ESP_RST_INT_WDT || reason == ESP_RST_WDT) {
        // Report heap status in case it's memory related
        size_t free_heap = esp_get_free_heap_size();
        size_t min_free_heap = esp_get_minimum_free_heap_size();
        GCS_SEND_TEXT(MAV_SEVERITY_WARNING, "Heap: free=%u min=%u", 
                     (unsigned)free_heap, (unsigned)min_free_heap);
        
        // Try to get WDT task name if available
        #if CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0 || CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1
        // Note: ESP-IDF doesn't provide direct API to get which task triggered WDT
        // but we can report that WDT was triggered
        GCS_SEND_TEXT(MAV_SEVERITY_WARNING, "WDT: Check console for task details");
        #endif
        
        // Log more details via ESP_LOG which might be captured
        ESP_LOGE("WDT", "Watchdog reset detected - heap free=%u min=%u", 
                 (unsigned)free_heap, (unsigned)min_free_heap);
    }
}

void Scheduler::init()
{

#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif

    // Debug via MAVLink STATUSTEXT - safe from serial contamination
    ESP32_DEBUG_INFO("Starting ESP32 Scheduler initialization");
    ESP32_DEBUG_VERBOSE("Scheduler running with CONFIG_FREERTOS_HZ=%d", CONFIG_FREERTOS_HZ);
    
    // Report ESP32 reset reason via MAVLink
    report_reset_reason();
    
    // Report debug protection status if enabled
#if defined(CONFIG_COMPILER_STACK_CHECK) || defined(CONFIG_HEAP_POISONING_COMPREHENSIVE) || defined(CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK)
    // Build protection flags string
    const char* protections = "ESP32 Debug: "
#ifdef CONFIG_COMPILER_STACK_CHECK
        "STACK "
#endif
#ifdef CONFIG_HEAP_POISONING_COMPREHENSIVE
        "HEAP "
#endif
#ifdef CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK
        "WATCH"
#endif
        ;
    GCS_SEND_TEXT(MAV_SEVERITY_INFO, "%s", protections);
    
    // Also print to console for local debugging
    printf("%s protections enabled\n", protections);
#endif

    // keep main tasks that need speed on CPU 0
    // pin potentially slow stuff to CPU 1, as we have disabled the WDT on that core.
    #define FASTCPU 0
    #define SLOWCPU 1

    // pin main thread to Core 0, and we'll also pin other heavy-tasks to core 1, like wifi-related.
    if (xTaskCreatePinnedToCore(_main_thread, "APM_MAIN", Scheduler::MAIN_SS, this, Scheduler::MAIN_PRIO, &_main_task_handle,FASTCPU) != pdPASS) {
    //if (xTaskCreate(_main_thread, "APM_MAIN", Scheduler::MAIN_SS, this, Scheduler::MAIN_PRIO, &_main_task_handle) != pdPASS) {
        ESP_LOGE("SCHEDULER", "FAILED to create task _main_thread on FASTCPU");
        hal.console->printf("FAILED to create task _main_thread on FASTCPU\n");
    } else {
    	ESP_LOGI("SCHEDULER", "OK created task _main_thread on FASTCPU");
    	hal.console->printf("OK created task _main_thread on FASTCPU\n");
    }

    if (xTaskCreatePinnedToCore(_timer_thread, "APM_TIMER", TIMER_SS, this, TIMER_PRIO, &_timer_task_handle,FASTCPU) != pdPASS) {
        hal.console->printf("FAILED to create task _timer_thread on FASTCPU\n");
    } else {
    	hal.console->printf("OK created task _timer_thread on FASTCPU\n");
    }	

    if (xTaskCreatePinnedToCore(_rcout_thread, "APM_RCOUT", RCOUT_SS, this, RCOUT_PRIO, &_rcout_task_handle,SLOWCPU) != pdPASS) {
       hal.console->printf("FAILED to create task _rcout_thread on SLOWCPU\n");
    } else {
       hal.console->printf("OK created task _rcout_thread on SLOWCPU\n");
    }

    if (xTaskCreatePinnedToCore(_rcin_thread, "APM_RCIN", RCIN_SS, this, RCIN_PRIO, &_rcin_task_handle,SLOWCPU) != pdPASS) {
       hal.console->printf("FAILED to create task _rcin_thread on SLOWCPU\n");
    } else {
       hal.console->printf("OK created task _rcin_thread on SLOWCPU\n");
    }

    // pin this thread to Core 1 as it keeps all teh uart/s feed data, and we need that quick.
    if (xTaskCreatePinnedToCore(_uart_thread, "APM_UART", UART_SS, this, UART_PRIO, &_uart_task_handle,FASTCPU) != pdPASS) {
        hal.console->printf("FAILED to create task _uart_thread on FASTCPU\n");
    } else {
    	hal.console->printf("OK created task _uart_thread on FASTCPU\n");
    }	  

    // we put those on the SLOW core as it mounts the sd card, and that often isn't connected.
    if (xTaskCreatePinnedToCore(_io_thread, "SchedulerIO:APM_IO", IO_SS, this, IO_PRIO, &_io_task_handle,SLOWCPU) != pdPASS) {
        hal.console->printf("FAILED to create task _io_thread on SLOWCPU\n");
    } else {
        hal.console->printf("OK created task _io_thread on SLOWCPU\n");
    }	 

    if (xTaskCreatePinnedToCore(_storage_thread, "APM_STORAGE", STORAGE_SS, this, STORAGE_PRIO, &_storage_task_handle,SLOWCPU) != pdPASS) { //no actual flash writes without this, storage kinda appears to work, but does an erase on every boot and params don't persist over reset etc.
        hal.console->printf("FAILED to create task _storage_thread on SLOWCPU\n");
    } else {
    	hal.console->printf("OK created task _storage_thread on SLOWCPU\n");
    }

    //   xTaskCreatePinnedToCore(_print_profile, "APM_PROFILE", IO_SS, this, IO_PRIO, nullptr,SLOWCPU);
    
    printf("SCHEDULER: All tasks created successfully\n");
}

template <typename T>
void executor(T oui)
{
    oui();
}

void IRAM_ATTR Scheduler::thread_create_trampoline(void *ctx)
{
    AP_HAL::MemberProc *t = (AP_HAL::MemberProc *)ctx;
    (*t)();
    free(t);

    // delete the calling task
    vTaskDelete(NULL);
}

/*
  create a new thread
*/
bool Scheduler::thread_create(AP_HAL::MemberProc proc, const char *name, uint32_t requested_stack_size, priority_base base, int8_t priority)
{
#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif

    // take a copy of the MemberProc, it is freed after thread exits
    AP_HAL::MemberProc *tproc = (AP_HAL::MemberProc *)calloc(1, sizeof(proc));
    if (!tproc) {
        return false;
    }
    *tproc = proc;

    uint8_t thread_priority = IO_PRIO;
    static const struct {
        priority_base base;
        uint8_t p;
    } priority_map[] = {
        { PRIORITY_BOOST, IO_PRIO},
        { PRIORITY_MAIN, MAIN_PRIO},
        { PRIORITY_SPI, SPI_PRIORITY},
        { PRIORITY_I2C, I2C_PRIORITY},
        { PRIORITY_CAN, IO_PRIO},
        { PRIORITY_TIMER, TIMER_PRIO},
        { PRIORITY_RCIN, RCIN_PRIO},
        { PRIORITY_IO, IO_PRIO},
        { PRIORITY_UART, UART_PRIO},
        { PRIORITY_NET, WIFI_PRIO1},
        { PRIORITY_STORAGE, STORAGE_PRIO},
        { PRIORITY_SCRIPTING, UART_PRIO},
    };
    for (uint8_t i=0; i<ARRAY_SIZE(priority_map); i++) {
        if (priority_map[i].base == base) {
#ifdef SCHEDDEBUG
            printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif
            thread_priority = constrain_int16(priority_map[i].p + priority, 1, 25);
            break;
        }
    }
    // chibios has a 'thread working area', we just another 1k.
    #define EXTRA_THREAD_SPACE 1024
    uint32_t actual_stack_size = requested_stack_size+EXTRA_THREAD_SPACE;

    tskTaskControlBlock* xhandle;
    BaseType_t xReturned = xTaskCreate(thread_create_trampoline, name, actual_stack_size, tproc, thread_priority, &xhandle);
    if (xReturned != pdPASS) {
        free(tproc);
        return false;
    }
    return true;
}

