Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
}

void IRAM_ATTR Scheduler::_uart_thread(void *arg)
{
#ifdef SCHEDDEBUG
    printf("%s:%d start \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    Scheduler *sched = (Scheduler *)arg;
    while (!sched->_initialized) {
        sched->delay_microseconds(2000);
    }
#ifdef SCHEDDEBUG
    printf("%s:%d initialised\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    while (true) {
        sched->delay_microseconds(1000);
        for (uint8_t i=0; i<hal.num_serial; i++) {
            hal.serial(i)->_timer_tick();
        }
        hal.console->_timer_tick();
    }
}


// get the active main loop rate
uint16_t IRAM_ATTR Scheduler::get_loop_rate_hz(void)
{
    if (_active_loop_rate_hz == 0) {
        _active_loop_rate_hz = _loop_rate_hz;
    }
    return _active_loop_rate_hz;
}

// once every 60 seconds, print some stats...
void Scheduler::print_stats(void)
{
    static int64_t last_run = 0;
    if (AP_HAL::millis64() - last_run > 60000) {
        char buffer[1024];
        vTaskGetRunTimeStats(buffer);
        printf("\n\n%s\n", buffer);
        heap_caps_print_heap_info(0);
        last_run = AP_HAL::millis64();
    }

    // printf("loop_rate_hz: %d",get_loop_rate_hz());
}

// Run every 30s (was 10s - increased for mLRS compatibility)
void Scheduler::print_main_loop_rate(void)
{
    static int64_t last_run = 0;
    if (AP_HAL::millis64() - last_run > 30000) {  // Changed from 10000 to 30000 for mLRS
        last_run = AP_HAL::millis64();
        
        // Reset WDT before potentially blocking console write
        esp_task_wdt_reset();
        
        // null pointer in here...
        const float actual_loop_rate = AP::scheduler().get_filtered_loop_rate_hz();
        const uint16_t expected_loop_rate = AP::scheduler().get_loop_rate_hz();
        
        // Use GCS instead of console to avoid blocking
        GCS_SEND_TEXT(MAV_SEVERITY_INFO, "Loop rate: %.1fHz / %uHz", 
                     actual_loop_rate, expected_loop_rate);
        
        // Don't use console->printf as it might block on UART
        // hal.console->printf("loop_rate: actual: %fHz, expected: %uHz\n", actual_loop_rate, expected_loop_rate);
        
        // Reset WDT after the operation
        esp_task_wdt_reset();
    }
}

void IRAM_ATTR Scheduler::_main_thread(void *arg)
{
    ESP_LOGI("MAIN", "===========================================");
    ESP_LOGI("MAIN", "ArduPilot main thread starting");
    ESP_LOGI("MAIN", "===========================================");
#ifdef SCHEDDEBUG
    printf("%s:%d start\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    Scheduler *sched = (Scheduler *)arg;

    if (sched->callbacks == nullptr) {
        ESP_LOGE("MAIN", "CRITICAL: callbacks is NULL - cannot proceed");
        vTaskDelete(NULL);
        return;
    }

#ifndef HAL_DISABLE_ADC_DRIVER
    hal.analogin->init();
#endif
    hal.rcout->init();

    ESP_LOGI("MAIN", "Calling ArduPilot setup() - this may take a while...");
    ESP_LOGI("SCHEDULER", "========================================");
    ESP_LOGI("SCHEDULER", "About to call callbacks->setup()");
    ESP_LOGI("SCHEDULER", "callbacks=%p", sched->callbacks);
    ESP_LOGI("SCHEDULER", "========================================");
    if (sched->callbacks != nullptr) {
        ESP_LOGI("SCHEDULER", "Callbacks valid, calling setup()");
        sched->callbacks->setup();
        ESP_LOGI("SCHEDULER", "callbacks->setup() returned");
    } else {
        ESP_LOGE("SCHEDULER", "ERROR: callbacks is NULL!");
    }
    ESP_LOGI("MAIN", "ArduPilot setup completed successfully");
    
    // Re-apply ESP-IDF log levels after parameter loading in setup()
    ESP32::esp32_params()->update_log_levels();

    sched->set_system_initialized();

    //initialize WTD for current thread on FASTCPU, all cores will be (1 << CONFIG_FREERTOS_NUMBER_OF_CORES) - 1
    wdt_init( TWDT_TIMEOUT_MS, 1 << FASTCPU ); // 3 sec

#ifdef SCHEDDEBUG
    printf("%s:%d initialised\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    static uint32_t max_loop_time = 0;  // Track max loop time across all iterations
    
    while (true) {
        // Reset WDT BEFORE running the loop to ensure we don't timeout
        static uint32_t wdt_reset_count = 0;
        static uint32_t last_wdt_reset_report = 0;
        esp_err_t wdt_err = esp_task_wdt_reset();
        if (wdt_err != ESP_OK) {
            GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: Reset failed err=%d at %lu ms", 
                         (int)wdt_err, (unsigned long)AP_HAL::millis());
            ESP_LOGE("WDT", "Failed to reset WDT: error %d", wdt_err);
        } else {
            wdt_reset_count++;
            // Report WDT reset success periodically
            uint32_t now = AP_HAL::millis();
            if (now - last_wdt_reset_report > 10000) {
                last_wdt_reset_report = now;
                // Suppress this message - it's just counting successful WDT feeds, not actual resets
                // GCS_SEND_TEXT(MAV_SEVERITY_INFO, "WDT: %lu resets OK", 
                //              (unsigned long)wdt_reset_count);
                wdt_reset_count = 0;
            }
        }
        
        // Track loop timing for debugging
        static uint32_t last_loop_start = 0;
        uint32_t loop_start = AP_HAL::millis();
        uint32_t time_since_last = loop_start - last_loop_start;
        
        // Warn if too much time passed since last loop (indicates blocking)
        if (last_loop_start != 0 && time_since_last > 2000) {
            GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: %lums since last loop!", 
                         (unsigned long)time_since_last);
        }
        last_loop_start = loop_start;
        
        sched->callbacks->loop();
        
        uint32_t loop_time = AP_HAL::millis() - loop_start;
        if (loop_time > max_loop_time) {
            max_loop_time = loop_time;
            if (loop_time > 2000) {  // Warn if loop takes > 2 seconds
                GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: Loop took %lums (max %lums)", 
                             (unsigned long)loop_time, (unsigned long)max_loop_time);
            }
        }
        
        sched->delay_microseconds(250);

        // run stats periodically
#ifdef SCHEDDEBUG
        sched->print_stats();
#endif
        sched->print_main_loop_rate();
        
